Revit 2027 API
BuiltInFailures.PerformanceFailures.LargeFamilyFile Property
 Family occupies XXX kilobytes of memory. Consider simplification of the family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LargeFamilyFile { get; }
Public Shared ReadOnly Property LargeFamilyFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LargeFamilyFile {
	FailureDefinitionId^ get ();
}
static member LargeFamilyFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace